content-org/cameronrmorris.org
#+hugo_base_dir: ../
#+seq_todo: TODO DRAFT DONE
#+options: creator:t
#+property: header-args :eval never-export

#+title: cameronrmorris.com
#+author: Cameron Morris
#+email: cameron.morris3@gmail.com

** DONE About
   CLOSED: [2018-04-30 Mon 19:19]
:PROPERTIES:
:export_hugo_section: ./
:export_file_name: about
:export_hugo_aliases: /about.html
:END:
*Who:* I am a programmer, bicycle enthusiast and overall geek.

*What:* I work as a software engineer for Amadeus North America. My development
is focused on payment applications in the travel industry specifically account
and loyalty systems.

*Where:* Greater Boston Area of Massachusetts.

If you want to get in touch with me feel free to send me an [[mailto:cameron.morris3@gmail.com][email]] or other
social means via the buttons above.

