content/about.md
+++
title = "About"
author = ["Cameron Morris"]
date = 2018-04-30T19:19:00-04:00
aliases = ["/about.html"]
draft = false
creator = "Emacs 25.3.1 (Org mode 9.1.7 + ox-hugo)"
+++

**Who:** I am a programmer, bicycle enthusiast and overall geek.

**What:** I work as a software engineer for Amadeus North America. My development
is focused on payment applications in the travel industry specifically account
and loyalty systems.

**Where:** Greater Boston Area of Massachusetts.

If you want to get in touch with me feel free to send me an [email](mailto:cameron.morris3@gmail.com) or other
social means via the buttons above.
